#сохраняем табличку соответствия грузинских букв и IPA с сайта Википедии в формате .csv, 
#при сохранении в качестве разделителя выбираем табы. 
f = open("translit.csv", "r", encoding="utf8")

#создаем пустой словарь, где ключами будут символы грузинских букв, а значениями - символы ipa
translit_dict = {}

#создаем цикл, который построчно читает нашу табличку и выбирает первый и третий столбец, 
#записывает значения и готовит словарь
for line in f:
	delimiter = line.split("	")
	character = delimiter [0]
	ipa = delimiter [2]
	translit_dict[character] = ipa 

#print(translit_dict) - проверяем словарь на соответствие символяам с помощью функции print()

#открываем файл с тектстом для транслита
text = open('text.txt', 'w')

#или копируем текст для обработки в переменную 
text1 = """იდიდე მარად, ჩვენო სამშობლოვ,
გმირთა კერა ხარ გაუქრობელი,
ქვეყანას მიეც დიდი სტალინი
ხალხთა მონობის დამამხობელი.
შენი ოცნება ასრულდა,
რისთვისაც სისხლი ღვარეო,
აყვავდი, ტურფა ქვეყანავ
ილხინე, ქართველთ მხარეო.
დიდი ოქტომბრის შუქით ლენინმა
შენ გაგინათა მთები ჭაღარა,
სტალინის სიბრძნემ ძლევით შეგმოსა
გადაგაქცია მზიურ ბაღნარად.
მოძმე ერების ოჯახში
დამკვიდრდი, გაიხარეო,
აყვავდი, ტურფა ქვეყანავ
ილხინე, ქართველთ მხარეო.
უხსოვარ დროდან ბრწყინავდა შენი
აზრი, ხმალი და გამბედაობა,
დღეს შენს დიდებას, ნათელ მომავალს
სჭედს სტალინური წრთობის თაობა.
საბჭოთა დროშა დაგნათის,
მზესავით მოელვარეო,
აყვავდი, ტურფა ქვეყანავ
ილხინე, ქართველთ მხარეო."""

#создаем переменную для хранения результата
translit = text

#запускаем процесс транслитерации
for key in translit_dict:
	translit = translit.replace(key, translit_dict[key])

#вывод результата на экран (исходный текст и транслит)
print (text)
print (translit)

#закрываем файл
text.close()
